Revit 2024 API
WireMaterialTypeSet.Contains Method
Tests for the existence of a wire material type within the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual bool Contains(
	WireMaterialType item
)
Visual Basic
Public Overridable Function Contains ( _
	item As WireMaterialType _
) As Boolean
Visual C++
public:
virtual bool Contains(
	WireMaterialType^ item
)
Parameters
item
Type: Autodesk.Revit.DB.Electrical.WireMaterialType
The wire material type to be searched for.
Return Value
The Contains method returns True if the wire material type is within the set, otherwise False.
See Also
WireMaterialTypeSet Class
Autodesk.Revit.DB.Electrical Namespace